app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Project"], ["description", "Create Proj. Management App."], ["created_at", "2015-11-21 00:53:46.421991"], ["updated_at", "2015-11-21 00:53:46.421991"]]