app/controllers/tasks_controller.rb

	def create
		@task = @project.tasks.create(task_params)
---
INSERT INTO "tasks" ("content", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "New Task"], ["project_id", 1], ["created_at", "2015-11-21 02:40:08.103972"], ["updated_at", "2015-11-21 02:40:08.103972"]]

	def destroy
		if @task.destroy
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 6]]

	def complete
		@task.update_attribute(:completed_at, Time.now)
---
UPDATE "tasks" SET "completed_at" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed_at", "2015-11-21 17:30:01.606578"], ["updated_at", "2015-11-21 17:30:01.607596"], ["id", 8]]

	def set_task
		@task = @project.tasks.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."project_id" = ? AND "tasks"."id" = ? LIMIT 1  [["project_id", 2], ["id", 8]]